Lurkr/app/models/subreddit.rb

  def self.addSubreddit(subredditParams)
    # TO-DO: Handle banned subreddit response and no response

    parsedResponse = JSON.parse(RestClient.get("http://reddit.com/r/#{subredditParams["name"]}.json"))
    if parsedResponse["data"]["children"].size == 0
      return nil
    else
      newSubreddit = Subreddit.find_by(name: subredditParams["name"])
      if newSubreddit
        oldSubscription = Subscription.find_by(subreddit_id: newSubreddit.id, user_id: subredditParams["user_id"])
        if !oldSubscription
          Subscription.addSubscription(newSubreddit.id, subredditParams["user_id"])
        else
          return "Issue"
        end
      else
        newSubreddit = Subreddit.create(name: subredditParams["name"])
---
SELECT  "subreddits".* FROM "subreddits" WHERE "subreddits"."name" = $1 LIMIT $2  [["name", "cats"], ["LIMIT", 1]]
SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."subreddit_id" = $1 AND "subscriptions"."user_id" = $2 LIMIT $3  [["subreddit_id", 8], ["user_id", 1], ["LIMIT", 1]]
INSERT INTO "subreddits" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "socks"], ["created_at", "2019-07-29 23:23:48.161275"], ["updated_at", "2019-07-29 23:23:48.161275"]]

  def self.extractPosts(subredditPosts)
    posts = []
    subredditPosts.each do |post|
      posts << {title: post["data"]["title"],
                img: post["data"]["thumbnail"],
                url: post["data"]["url"],
                num_comments: post["data"]["num_comments"],
                author: post["data"]["author"],
                self_text: post["data"]["selftext"],
                up_votes: post["data"]["ups"],
                permalink: post["data"]["permalink"],

---
INSERT INTO "subreddits" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "harrypotter"], ["created_at", "2019-08-01 07:16:34.435227"], ["updated_at", "2019-08-01 07:16:34.435227"]]