Lurkr/app/models/subscription.rb

  def self.addSubscription(subredditId, userId)
    Subscription.create(subreddit_id: subredditId, user_id: userId);
---
INSERT INTO "subscriptions" ("user_id", "subreddit_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["subreddit_id", 7], ["created_at", "2019-07-29 20:50:55.779521"], ["updated_at", "2019-07-29 20:50:55.779521"]]