Lurkr/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def self.getUserInfo(userId)

    user = User.find_by(id: userId)