Lurkr/app/controllers/settings_controller.rb

  def update
    settings = Setting.find_by(id: params[:id])
    newCol = params[:columns].to_i()
    settings.update(num_cols: newCol)
    # byebug
    settings = Setting.find_by(id: params[:id])
---
SELECT  "settings".* FROM "settings" WHERE "settings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "settings" SET "num_cols" = $1, "updated_at" = $2 WHERE "settings"."id" = $3  [["num_cols", 1], ["updated_at", "2019-08-01 05:18:50.985418"], ["id", 1]]