Lurkr/app/controllers/subreddits_controller.rb

  def destroy
    subreddit = Subreddit.find_by(name: subredditParams["name"])
    subscriptionToRemove = Subscription.find_by(subreddit_id: subreddit.id, user_id: subredditParams["user_id"])
    # byebug
    subscriptionToRemove.destroy()
---
SELECT  "subreddits".* FROM "subreddits" WHERE "subreddits"."name" = $1 LIMIT $2  [["name", "cars"], ["LIMIT", 1]]
SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."subreddit_id" = $1 AND "subscriptions"."user_id" = $2 LIMIT $3  [["subreddit_id", 1], ["user_id", 1], ["LIMIT", 1]]
DELETE FROM "subscriptions" WHERE "subscriptions"."id" = $1  [["id", 2]]