Lurkr/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Chris"], ["LIMIT", 1]]
---
  def checkForUser
    # byebug
    user = User.find_by(username: params["username"])